[
  {
    "name": "Qu'est-ce que la logique ?",
    "answer": "La première chose à remarquer au sujet de la logique, est qu'elle est un terme qui est couramment utilisé au quotidien. Comme si la plupart des gens n'avaient pas de doute sur ce qu'elle est. Par \"logique\", on veut souvent dire que quelque chose est évident, cohérent, manifeste. Cet usage du mot logique existe bien, bien qu'il soit très indéterminé et synonymique d'autres mots. Cependant sur ce site, j'utiliserai le mot de logique dans un sens qui remonte à la Grèce Antique, je m'intéresserai à son sens aristotélicien : la logique est la codification des règles permettant de faire des inférences valides. Cette définition sera développée dans les questions suivantes."
  },
  {
    "name": "Quel lien peut-on faire entre le langage et la logique ?",
    "answer": "Lorsque nous parlons, argumentons, décrivons le monde, etc, nous émettons des propositions souvent complexes. Celles-ci peuvent être décomposées en des propositions plus élementaires, lesquels peuvent aussi être décomposées. Au bout du compte, nous pouvons arriver à des éléments premiers, indécomposables, irréductibles à d'autres choses. Les calculs de logique ne sont donc ni plus ni moins qu'un outil pour analyser les discours en général, et ce site se propose de faciliter l'accès à cet outil. Comme pour tout outil, chacun est libre ensuite d'en avoir l'usage qu'il souhaite. Ce site ne défend aucunement l'idée qu'il serait important de tout aborder par la logique."
  },
  {
    "name": "Qu'est-ce qu'une proposition ?",
    "answer": "Une proposition est un énoncé qui est soit vrai soit faux. La logique des propositions permet de faire des calculs dont elles sont l'objet. Une proposition affirme quelque chose au sujet du monde et de ce qui le compose. Il y a deux genres de propositions : les propositions atomiques (comme leur nom l'indique, elles sont indécomposables), et les propositions complexes, qui peuvent être décomposées en propositions atomiques.",
    "example": "Socrate est un homme. La Terre est ronde. La Terre est plate. Le sable est bleu. Macron a supprimé l'impôt sur la fortune. Il fera 50 à 55 degré en été, dans certaines régions de l'Europe en 2050.\n(\"La Terre.\" ou \"Socrate\", à l'inverse, ne sont pas des propositions.)"
  },
  {
    "name": "Qu'est-ce qu'un prédicat ?",
    "answer": "La logique des propositions reste impuissante lorsqu'il s'agit d'analyser le contenu des propositions. C'est là que la logique des prédicats intervient. Elle permet d'analyser les propositions comme étant composées d'un sujet, d'un copule, et d'un prédicat (au moins un de chaque). En isolant le copule et le prédicat on peut former une fonction prédicative.",
    "example": "Hippathie est une femme : \"Hippathie\" est le sujet, \"est\" le copule, \"femme\" le prédicat. \"x est une femme\" est la fonction prédicative de cette proposition."
  },
  {
    "name": "Qu'est-ce qu'une inférence ?",
    "answer": "Une inférence est un énoncé que l'on tient pour vrai sur la base d'un raisonnement logique, à partir d'autres énoncés admis comme vrais (prémisses). La dernière inférence d'une déduction valide est sa conclusion.",
    "example": "Si j'admets que \"Socrate est un homme\", que \"Tous les hommes sont mortels\", alors je peux inférer que \"Socrate est mortel\".\nSi j'admets que \"Toute action est politique\", que \"Faire ce site est une action\", alors je peux inférer que \"Faire ce site est politique\". "
  },
  {
    "name": "Que sont la vérité et la validité ?",
    "answer": "Un raisonnement logique ne peut pas être vrai ou faux, seulement valide ou invalide. Un raisonnement valide n'est pas un raisonnement vrai, c'est un raisonnement qui conserve la valeur de vérité des prémisses qu'il manipule. La logique ne concerne que la conservation de la valeur de vérité, donc si une personne veut produire des raisonnements valides et vrais, c'est à elle de faire l'effort de trouver des prémisses vraies, en observant le monde.",
    "example": "\"Tous les chats sont bleus, tous les bleus sont du sable, tous les chats sont du sable\" est un raisonnement valide, bien qu'il ne soit pas basé sur des prémisses vraies."
  },
  {
    "name": "Qu'est-ce qu'une déduction ? Et comment les distinguer des inductions ?",
    "answer": "Une déduction est une série d'inférence menant à une conclusion. Pour être valide, cette déduction doit être composée d'inférences en accord les règles de logique. Ce site propose à l'utilisateur de faire des déductions. Et une induction est une généralisation faite sur la base de cas particulier(s), par conséquent les inductions n'ont pas la rigueur des déductions."
  },
  {
    "name": "Que sont les connecteurs propositionnels ?",
    "answer": "Ce sont des outils permettant de faire des opérations logiques sur des propositions. (Tout comme les opérateurs mathématiques +, -, ×, ÷, permettent de faire des opérations sur des nombres.) On peut ainsi lier une proposition et une proposition q par le connecteur propositionnel de la conjonction, \"∧\". Ce qui s'écrit p∧q, et se lit \"p et q\". Voici la liste des connecteurs propositionnels, que ce site vous permet de manipuler : ~ ∧ ∨ ⊻ ⊃ ⊂ ≡ ↓ |. Ces connecteurs sont des connecteurs vérifonctionnels, c'est-à-dire que leur signification est déterminée par un emplacement dans une table de vérité. Tous les connecteurs ne sont pas vérifonctionnels, par exemple certains connecteurs logiques des langues naturelles, comme \"parce que\" ou \"car\". Cet article de Wikipédia https://fr.wikipedia.org/wiki/Connecteur_logique#Linguistique recense bien les connecteurs logiques (associés à des connecteurs vérifonctionnels, ou non) de la langue française."
  },
  {
    "name": "Qu'appelle-t-on \"connecteur dominant\" ?",
    "answer": "Dans une formule logique telle que \"~(q∧~p)\" ou \"(p∧q)∧(p∧r)\", on a plusieurs symboles de logique, et même des parenthèses. En débutant la logique on peut avoir un doute sur la manière dont il faut lire ces formules. La notion de connecteur dominant résout le problème : c'est le connecteur principal qui relie une partie de la formule à une autre, et il y en a un et un seul par formule, de même qu'il n'y a qu'un seul ensemble à sa droite et un seul à sa gauche (sauf pour \"~\" qui n'interprète rien à sa gauche). Ainsi une formule comme \"p∧q∧r\" n'apparaîtra jamais sur ce site, ni dans aucun calcul de logique (à ma connaissance)."
  },
  {
    "name": "La règle d'élimination de la double négation, ~~e, (qui dit qu'une double négation d'une proposition est toujours égale à l'affirmation de cette proposition) est-elle juste, et toujours évocable pour les doubles négations de la vie courante ?",
    "answer": "Non, ce n'est le cas dans les calculs de logique de ce site que parce que ceux-ci sont basés sur des tables de vérité qui empêchent toute autre possibilité d'interprétation de ce que signifie une double négation. Au contraire, dans les dialogues de la vie courante, il peut exister des doubles négations ayant toutes sortes d'autres significations, la règle ~~e ne saurait être invoquée dans de tels cas."
  },
  {
    "name": "Que sont les connecteurs prédicatifs ?",
    "answer": ""
  },
  {
    "name": "Quelle différence entre un connecteur logique et une relation logique ?",
    "answer": "Les connecteurs logiques permettent de faire des opérations de logique, là où les relations logiques parlent de la logique elle-même, à la manière d'un méta-langage. (Cette opposition existe aussi dans les mathématiques : + - * / sont des opérateurs, alors que = > < sont des relations. \"Un et un font deux\" n'est un propos de la même nature que de \"un est égal à un\" : le premier exemple est une opération, et l'autre un simple constat de vérité.) En logique, ~ ∧ ∨ ⊻ ⊃ ≡ sont des opérateurs, et → ↔ des relations."
  },
  {
    "name": "Y a-t-il différents genres de règles ?",
    "answer": "On peut distinguer 3 genres de règles : les règles structurelles (rep, reit, hyp...), les règles de connecteurs (∧i, ...), et les règles dérivées (~~e, ...). Les deux premières sont des règles acceptées par défaut, sans démonstration ; les règles dérivées sont au contraire démontrables à partir des précédentes. Elles sont comme des raccourcis. Il est possible de déduire toutes les règles des connecteurs propositionnels en ayant pour base ~ et ∧ (ces deux connecteurs forment donc ce qu'on appelle un \"système complet\"), par exemple A⊃B peut s'écrire ~(A∧~B)."
  },
  {
    "name": "Que sont le théorème, la tautologie, et la preuve logique ?",
    "answer": "Un théorème logique est la conclusion d'une déduction qui est toujours vraie quelle que soit la valeur de vérité des prémisses qu'on lui donne. Une telle déduction est, elle, appelée \"preuve logique\". Les théorèmes existent en fonction des règles de logique qu'on adopte. Si A est un théorème, on peut l'écrire ⊢A. Une tautologie est une formule qui est vraie en toute circonstance. Ainsi, un théorème logique est toujours une tautologie, et une tautologie correspond toujours en puissance à un théorème logique. Si A est une tautologie, on peut l'écrire ⊨A.",
    "example": "La terre est une planète ou n'est pas une planète. ⊢~(p∧~p). ⊨~(p∧~p)."
  },
  {
    "name": "Que sont la contradiction et la contrariété ?",
    "answer": "Une contradiction revient à admettre vraie deux propositions ou ensembles de propositions, qui ne peuvent l'être ensemble. (Elles peuvent être fausses ensembles, en revanche.) Une contrariété admet des possibilités tierces.",
    "example": "\"Ce chat est entièrement entièrement noir\" et \"Ce chat n'est pas entièrement noir\" sont des propositions contradictoires. \"Ce chat est en partie noir\" et \"Ce chat est en partie blanc\" sont des propositions contraires."
  },
  {
    "name": "Que sont l'hypothèse et le raisonnement par l'absurde ?",
    "answer": "Faire une hypothèse conduit à deux possibilités : ou bien, \"voir ce qui s'en suit et conclure dessus\" (⊃i), ou bien, faire un raisonnement par l'absurde pour rejeter l'hypothèse (~i).",
    "example": "Exemple pour le premier cas : un climatologue peut faire des hypothèses sur l'avenir du climat en admettant certaines propositions comme totalement irréfutable. S'il admet qu'en 2100 il fera 3 degrés de plus (appelons cette proposition \"p\"), il peut établir un raisonnement scientifique sur la base de ses connaissances, et arriver à la conclusion irréfutable selon ces connaissances, que, par exemple, le niveau de la mer montera alors de 2 mètres (appelons cette proposition \"q\"). Ou dit formellement : 1. si p, 2. (raisonnement) 3. alors q."
  },
  {
    "name": "Quelle différence entre le conditionnel, ⊃, et l'implication, → ?",
    "answer": "L'implication décrit une relation logique alors que le conditionnel permet de faire des opérations. Ces deux connecteurs sont parfois confondus car certaines traditions les font porter le même nom (implication) voire le même symbole (la flèche allant de la gauche vers la droite), mais ils sont très différents : l'implication décrit la nature de la logique, là où le conditionnel permet d'utiliser la logique. En ce sens, le conditionnel désigne une condition particulière, là où il s'agit d'une condition généralisable pour l'implication."
  },
  {
    "name": "Qu'est-ce qu'une table de vérité ?",
    "answer": "Une table de vérité est une liste de toutes les combinaisons de valeurs de vérité que peut prendre un certain ensemble de propositions. A chacune de ces combinaisons correspond une certaine relation logique, laquelle peut être symbolisée par un certain connecteur logique. [à développer] "
  },
  {
    "name": "Qu'est-ce qu'une modalité ?",
    "answer": ""
  },
  {
    "name": "Que sont les diagrammes de Venn ?",
    "answer": ""
  },
  {
    "name": "Et les raisonnements fallacieux dans tout ça ?",
    "answer": ""
  },
  {
    "name": "Que sont la symétrie, la transivité et la réflexivité et qu'ont-elles en commun ? Et relativement à l'identité ?",
    "answer": ""
  },
  {
    "name": "Faut-il dépasser l'analyse logique ?",
    "answer": "Oui, pour deux raisons. Premièrement, l'analyse logique est totalement impuissante pour déterminer quelles prémisses sont vraies et fausses. Pour cela il faut observer le monde, douter de soi, etc. L'analyse logique est seulement utile pour reconnaître des raisonnements valides, donc il ne faut pas se limiter à elle. Deuxièmement, l'analyse logique interprète la vérité des propositions de manière binaire (elles sont soient vraies soit fausses, on appelle cela la bivalence), or les interprétations que nous faisons du réel (ou la manière d'en parler : les métaphores, les probabilités...) peuvent rarement être réduits à des descriptions aussi strictes."
  },
  {
    "name": "Quels auteurs antiques abordent la logique ?",
    "answer": "Aristote aborde la logique des prédicats dans les Premiers Analytiques (il est la première personne à écrire sur la logique, ou du moins la première dont on ait conservé des écrits), et de nombreux stoïciens, comme Chrysippe, abordent la logique des propositions. La question de savoir ce qu'est le conditionnel a d'ailleurs fait de nombreux débats chez les stoïciens. Chrysippe avait aussi l'idée que lorsque nous raisonnons, il y a quelque chose qui semble être un guide a priori, qui justifie toute déduction valide avant même qu'elle soit posée."
  }
]
